/* Author: David Zaretsky
 *
 * Task:
 * Создать класс, обеспечивающего работу с рациональными дробями. Класс должен уметь
 * работать как с рациональными дробями, так и с целыми числами. Должны быть определены операции
 * сложения, вычитания, умножения и деления. Дроби должны быть упрощены и приведены к правильным.
 */

#include <iostream>
using namespace std;

int main(int argc, char *argv[]) {
    cout << "Hello World!" << endl;
    return 0;
}
