/* Author: David Zaretsky
 *
 * Task:
 * Создать класс String, реализующий работу со строчками с учетом числа
 * обращений к ним (со счетчиками). Так, например, при присвоении одной строки
 * другой, не выделяется новая память для хранения строки, а лишь увеличивается
 * счетчик ее использования. Класс должен предоставлять основные операции по
 * работе со строками (сложение, сравнение, присваивание и т.д.). Данный класс должен
 * позволять использовать себя (те данные, которые он хранит) в функциях стандартной
 * библиотеки.
 */

#include <iostream>

using namespace std;

int main(int argc, char *argv[]) {
    cout << "Hello World!" << endl;
    return 0;
}
